<script setup lang="ts">
import { useNewsStore } from '@/stores/useNewsStore'

const store = useNewsStore()


</script>
<template>
    <article role="region" aria-label="Стрічка чарівних новин">
<section id = "protv">
            <h2>Про тваринок</h2>
            <h3><strong>Останні новини</strong> про пухнастиків.</h3>
            <p><em>Поради</em> та цікаві факти.</p>

    <dl>
        <dt>Спостереження за поведінкою</dt>
        <dd>Навіть у звичайних тварин можна помітити незвичайні звички: деякі з них віддають перевагу певним місцям, ніби відчувають там спокій або безпеку.</dd>
        <dt>Нічна активність</dt>
        <dd>Багато тварин проявляють активність у сутінках або вночі, коли світ стає тихішим і менш передбачуваним — саме тоді їхня поведінка змінюється найбільше.</dd>
        <dt>Зв'язок із людиною</dt>
        <dd>Деякі тварини здатні тонко реагувати на емоційний стан людини, ніби відчуваючи настрій без слів, що створює особливий рівень взаєморозуміння.</dd>
    </dl>

    <img src="@/assets/img1.jpg" alt="Кадри з природи" title="Пухнастики">
</section>

<section id="smak">
    <h2>Нові смаколики</h2>
    <h3>Новини зі світу <strong>десертів</strong>.</h3>
    <p>Новинки та відома <em>класика</em>.</p>

    <dl>
        <dt>Дегустація чарівних новинок</dt>
        <dd>Навіть серед звичайних десертів можна знайти справжні кондитерські шедеври: деякі з них мають унікальні смаки, ніби створені самими лісовими магами для втіхи душі.</dd>
        <dt>Вечірні частування</dt>
        <dd>Багато магічних ласощів найкраще смакують у сутінках або вночі, коли світ наповнюється загадковістю — саме тоді їхній смак та аромат розкриваються на повну силу.</dd>
        <dt>Магія в кожному шматочку</dt>
        <dd>Деякі смаколики здатні тонко реагувати на настрій ласуна, ніби відчуваючи його бажання без слів, що створює особливу атмосферу справжньої кондитерської казки.</dd>
    </dl>
    <img src="@/assets/img2.jpg" alt="Смаколики" title="Смаколики">
</section>

<section id = "eks">
    <h2>Екскурсії</h2>
    <h3>Актуальні екскурсії по території <strong>чарівного лісу</strong>.</h3>
    <p>Каталог та <em>екскурсоводи</em>.</p>

    <dl>
        <dt>Мудра сова</dt>
        <dd>Озеро фей — тихе та загадкове місце, де за легендами у вечірній час можна побачити мерехтіння крил маленьких істот над водою.</dd>
        <dt>Лис-оповідач</dt>
        <dd>Старий дуб — древнє дерево, що зберігає історії лісу; екскурсії тут наповнені легендами та несподіваними відкриттями.</dd>
        <dt>Білка-мандрівник</dt>
        <dd>Магічний водоспад — місце, де вода ніби світиться у променях світла, створюючи атмосферу спокою та легкого чарівного настрою.</dd>
    </dl>

    <figure>
        <img src="@/assets/img3.jpg" alt="Екскурсії" title="Територія">
        <figcaption>Останні екскурсії</figcaption>
    </figure>
</section>
</article>
</template>